read_verilog -sv D_LATCH_DUAL_READ_PORT.v ../NOT/NOT.v ../TINV/TINV.v ../D_LATCH/D_LATCH.v ../RV523_MOSFETS.v
prep -top D_LATCH_DUAL_READ_PORT
flatten
write_json D_LATCH_DUAL_READ_PORT.net.json
exec -- python3 ../../tools/yosysJsonToKicadNetlist.py D_LATCH_DUAL_READ_PORT.net.json D_LATCH_DUAL_READ_PORT.net --spice D_LATCH_DUAL_READ_PORT.ckt