read_verilog -sv NOT.v ../RV523_MOSFETS.v
prep -top NOT
flatten
write_json NOT.net.json
write_spice -neg GND -pos VDD NOT.ckt
exec -- python3 ../../tools/yosysJsonToKicadNetlist.py NOT.net.json NOT.net