read_verilog -sv NOR3.v ../RV523_MOSFETS.v
prep -top NOR3
flatten
write_json NOR3.net.json
exec -- python3 ../../tools/yosysJsonToKicadNetlist.py NOR3.net.json NOR3.net --spice NOR3.ckt